# Задача No3. Решение в группах
# В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами.
#  За каждой партой может сидеть два учащихся. Известно количество учащихся в каждом из трех классов.
#  Выведите наименьшее число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку) Output: 32

# _________________________________________
# n = 385916
# n1 = ((n//1000)//100)
# n2 = ((n//1000) % 100)//10
# n3 = (n//1000) % 10


# m1 = (n % 1000)//100
# m2 = ((n % 1000) % 100)//10
# m3 = (n % 1000) % 10
# print(n1, n2, n3, m1, m2, m3)

# if n1+n2+n3 == m1+m2+m3:
#     print("yes")
# else:
#     print("no")
# ______________________________________

# n = 385916

# print (n%1000)
# # print(n//1000)
# a = 8
# b = 7
# c = 156

# if c%a == 0 or c%b == 0:
#     print('Yes')
# else: print('No')
# print (c%a, c&b)
# ---------------------------------------------------------

# coins = [0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0]
# count = 0
# for i in coins:
#     if i ==0:
#         count= count +1
# print(count)

# ///////////////////////////////
